
// Check the source code for the questions
const wordList = [
    {
      word: "vpn",
      hint: "บริการที่ช่วยปกป้องความเป็นส่วนตัวออนไลน์ของคุณโดยปกปิดตำแหน่งที่อยู่.",
    },
    {
      word: "cloud",
      hint: "บริการเช่น Google Drive ที่จัดเก็บไฟล์ออนไลน์.",
    },
    
    
    {
      word: "chipset",
      hint: "หน่วยประมวลผลข้อมูลเพื่อทำงานให้เสร็จสิ้น ซึ่งถือเป็นสมองของอุปกรณ์อิเล็กทรอนิกส์ปัจจุบันคือ cpu.",
    },
    
    {
      word: "virus",
      hint: "มัลแวร์ ประเภทหนึ่งที่เมื่อถูกเรียกใช้งาน จะทำซ้ำตัวเองโดยปรับเปลี่ยน โปรแกรมคอมพิวเตอร์ อื่นและแทรกโค้ดของตัวเอง.",
    },
    {
      word: "antispyware",
      hint: "ซอฟต์แวร์ที่ตรวจจับและลบสปายแวร์ ซึ่งสามารถติดตามกิจกรรมออนไลน์ของคุณโดยที่ผู้ใช้ไม่รู้ตัว.",
    },
    {
      word: "aircooler",
      hint: "ระบบระบายความร้อนด้วยพัดลม เป็นหนึ่งอุปกรณ์ที่ช่วยในการระบายความร้อนของ CPU.",
    },
    {
      word: "networkadapter",
      hint: "อุปกรณ์ที่ช่วยให้คอมพิวเตอร์ของผู้ใช้เชื่อมต่อกับเครือข่ายผ่านทาง Wi-Fi หรืออีเทอร์เน็ต.",
    },
    {
      word: "harddisk",
      hint: "เป็นอุปกรณ์จัดเก็บข้อมูลที่จำเป็นของคอมพิวเตอร์ ใช้เพื่อเก็บรักษาไฟล์ และข้อมูลของผู้ใช้ในระยะยาว.",
    },
    
    {
      word: "worm",
      hint: "โปรแกรมคอมพิวเตอร์ที่ถูกออกแบบมาให้สามารถแพร่กระจายตัวเองจากเครื่องคอมพิวเตอร์เครื่องหนึ่ง ขโมยข้อมูลที่สำคัญ เปลี่ยนการตั้งค่าความปลอดภัยของเครื่อง.",
    },
    {
      word: "texteditor",
      hint: "ซอฟต์แวร์สำหรับการแก้ไขไฟล์ข้อความเช่น Notepad ใช้สำหรับการเขียนโค้ดหรือเอกสารพื้นฐาน.",
    },
    {
      word: "trojan",
      hint: "โปรแกรมคอมพิวเตอร์ที่ถูกบรรจุเข้าไปในคอมพิวเตอร์ เพื่อลอบเก็บข้อมูลของคอมพิวเตอร์เครื่องนั้นเช่น ข้อมูลชื่อผู้ใช้ .",
    },
    {
      word: "ram",
      hint: "หน่วยความจำระยะสั้นที่ซึ่งข้อมูลถูกเก็บไว้ตามที่โปรเซสเซอร์ต้องการ.",
    },
    {
      word: "operatingsystem",
      hint: "ซอฟต์แวร์ที่ทำให้คอมพิวเตอร์ของคุณทำงานได้เช่น Windows, macOS หรือ Linux.",
    },
    {
      word: "webprotection",
      hint: "โปรแกรมที่บล็อกเว็บไซต์ที่เป็นอันตรายไม่ให้โหลดบนคอมพิวเตอร์ของผู้ใช้.",
    },
    
  
    {
      word: "mainboard",
      hint: "เป็นแผงวงจรหลักที่มีความสำคัญซึ่งมีหน้าที่คอยควบคุมและจัดการให้กับอุปกรณ์ต่างๆทำงานเชื่อมโยงกัน โดยเมนบอร์ดจะรับส่งข้อมูลต่าง ๆ.",
    },
    {
      word: "ssd",
      hint: "เป็นอุปกรณ์จัดเก็บข้อมูลภายในคอมพิวเตอร์ ที่ได้รับการพัฒนาต่อยอดมาจากฮาร์ดดิสก์สามารถทำงานอ่านเขียนข้อมูลได้ไวกว่า HDD.",
    },
    
    {
      word: "case",
      hint: "ตัวถังซึ่งเป็นที่รวบรวมของอุปกรณ์คอมพิวเตอร์เป็นโครงสร้างสำคัญที่ช่วยจัดระเบียบและปกป้องชิ้นส่วนภายใน.",
    },
    {
      word: "fancase",
      hint: "ใช้สำหรับ การระบายความร้อนแบบแอคทีฟ พัดลมใช้เพื่อดึงอากาศเย็นเข้ามาจากภายนอกเคส ไล่อากาศอุ่นออกจากภายใน.",
    },
    {
      word: "java",
      hint: "เป็นภาษาที่สนับสนุนการเขียนโปรแกรมเชิงวัตถุแบบสมบูรณ์ ซึ่งเหมาะสำหรับพัฒนาระบบที่มีความซับซ้อน การพัฒนาโปรแกรมแบบวัตถุ.",
    },
   
    {
      word: "charlesbabbage",
      hint: "นักคณิตศาสตร์ชาวอังกฤษได้ประดิษฐ์เครื่องมือที่เรียกว่าเครื่องหาผลต่าง เพื่อใช้คำนวณและพิมพ์เขาได้รับการยกย่องว่าเป็นผู้ออกแบบคอมพิวเตอร์อัตโนมัติดิจิทัลเครื่องแรก.",
    },
    {
      word: "ipaddress",
      hint: "ตัวระบุตัวเลขเฉพาะที่กำหนดให้กับอุปกรณ์ทุกเครื่องบนเครือข่าย ที่อยู่ IP ใช้เพื่อระบุอุปกรณ์และใช้งานการสื่อสารระหว่างอุปกรณ์เหล่านั้น.",
    },
    {
      word: "dns",
      hint: "ระบบชื่อโดเมน เป็นโปรโตคอลที่ใช้ในการแปลชื่อโดเมนที่มนุษย์สามารถอ่านได้ เช่น www.google.com เป็นที่อยู่ IP ที่คอมพิวเตอร์สามารถเข้าใจได้.",
    },
    {
      word: "array",
      hint: "ประเภทของข้อมูลที่สามารถเก็บข้อมูลประเภทเดียวกันแบบเป็นลำดับได้ โดยข้อมูลนั้นจะอยู่ในตัวแปรตัวเดียวกันที่เรียกว่า ตัวแปรอาเรย์.",
    },
  
    {
      word: "driver",
      hint: "ทำหน้าที่เป็นสะพานเชื่อมระหว่างฮาร์ดแวร์และซอฟต์แวร์โดยสื่อสารกับระบบปฏิบัติการของอุปกรณ์.",
    },
    
    {
      word: "files",
      hint: " กลุ่มของข้อมูลที่อาจประกอบด้วยตัวอักษร หรือรูปภาพ.",
    },
    {
      word: "media",
      hint: "สิ่งใดก็ตามที่บรรจุข้อมูล เพื่อให้ผู้ส่งและผู้รับสามารถสื่อสารกันได้ตรงตามวัตถุประสงค์.",
    },
    {
      word: "links",
      hint: "การเชื่อมโยงกันระหว่างเว็บเพจ จากหน้าหนึ่งไปยังอีกหน้าหนึ่ง หรือจากจุดหนึ่งไปยังอีกจุดหนึ่งภายในหน้าเดียวกัน โดยปรากฏเป็นข้อความหรือรูปภาพที่สามารถคลิกได้.",
    },
  
    {
      word: "layer",
      hint: "ชั้นของการซ้อนทับกันของภาพเป็นชั้นๆ เปรียบเสมือนเเผ่นใส่ที่เมื่อเรานำมาวางทับกันก็จะสามารถมองเห็นภาพที่เกิดจากการซ้อนกันของแผ่นใสได้เหมือนเป็นภาพเดียว.",
    },
    {
      word: "malware",
      hint: "โปรแกรมประสงค์ร้ายที่ถูกเขียนขึ้นมา เพื่อทำอันตรายกับข้อมูลในระบบ เช่น ทำให้เครื่องคอมพิวเตอร์ทำงานผิดปกติ.",
    },
    
    {
      word: "hardware",
      hint: "ส่วนของอุปกรณ์ที่เกี่ยวข้องกับคอมพิวเตอร์ทั้งหมดเป็นชุดองค์ประกอบของเครื่องและระบบคอมพิวเตอร์ เพื่อทำให้เกิดการใช้งานอย่างสมบูรณ์แบบ.",
    },
    {
      word: "software",
      hint: "โปรแกรมหรือชุดคำสั่งที่ใช้สั่งงานเครื่องคอมพิวเตอร์ หรืออุปกรณ์อิเล็กทรอนิกส์อื่น ๆ ให้ทำงาน เปรียบเสมือนตัวกลางที่นำพา user ให้เข้าไปถึงในระบบต่าง ๆ.",
    },
    {
      word: "cybersecurity",
      hint: "ความมั่นคงปลอดภัยทางไซเบอร์ ที่ต้องการป้องกันและการรักษาความปลอดภัยของระบบคอมพิวเตอร์ ระบบเครือข่าย และข้อมูลที่เกี่ยวข้อง.",
    },
  
    {
      word: "networking",
      hint: "เครือข่ายคอมพิวเตอร์เป็นกลุ่มของอุปกรณ์ที่เชื่อมต่อกันซึ่งแบ่งปันทรัพยากรและข้อมูลได้แก่ คอมพิวเตอร์ เซิร์ฟเวอร์และฮาร์ดแวร์อื่นๆ.",
    },
    {
      word: "ai",
      hint: "เป็นเทคโนโลยีที่มีความสามารถในการแก้ปัญหาเหมือนมนุษย์ จำลองความฉลาดของมนุษย์ โดยสามารถจดจำภาพ เขียนบทกวี และคาดการณ์.",
    },
    {
      word: "mouse",
      hint: "อุปกรณ์ชี้ตำแหน่งที่ใช้ในการเลื่อนเคอร์เซอร์บนหน้าจอและโต้ตอบกับคอมพิวเตอร์.",
    },
    {
      word: "keyboard",
      hint: "อุปกรณ์อินพุตที่ใช้พิมพ์ข้อความ ตัวเลข และคำสั่งอื่นๆ ลงในคอมพิวเตอร์.",
    },
    {
      word: "battery",
      hint: "อุปกรณ์ที่เก็บพลังงาน โดยทั่วไปพบได้ในแล็ปท็อป โทรศัพท์ และอุปกรณ์อิเล็กทรอนิกส์พกพาอื่นๆ.",
    },
    {
      word: "monitor",
      hint: "หน้าจอที่แสดงทุกสิ่งที่คุณเห็นบนคอมพิวเตอร์.",
    },
    {
      word: "antivirus",
      hint: "ซอฟต์แวร์เช่นAVG หรือ Bitdefender ที่สแกนคอมพิวเตอร์ของคุณเพื่อหาไวรัสและช่วยกำจัดไวรัสออกไป.",
    },
    
    {
      word: "photoviewer",
      hint: "ซอฟต์แวร์เช่น Windows Photos หรือ Preview ที่ช่วยให้ผู้ใช้ดูและจัดการรูปภาพและภาพของผู้ใช้งาน.",
    },
    {
      word: "ups",
      hint: "อุปกรณ์จ่ายไฟสำรองที่ช่วยให้คอมพิวเตอร์ของผู้ใช้ทำงานได้เมื่อไฟดับ.",
    },
  
    {
      word: "speaker",
      hint: "อุปกรณ์ที่ผลิตเสียง มักเชื่อมต่อกับคอมพิวเตอร์เพื่อเล่นเพลง วิดีโอ หรือเกม.",
    },
    
  ];
  